content/news.org
#+include: ../elements/title.org
#+include: ../elements/navigation.org

#+description: Career timeline of Marlin P. Strub: positions, publications, field tests, and personal milestones.

* Logbook

#+begin_export html
<div class="legend">
  <div class="label">Legend</div>
  <div class="items">
    <span class="item"><span class="icon-publication"></span> publication</span>
    <span class="item"><span class="icon-code"></span> open-source</span>
    <span class="item"><span class="icon-position"></span> new position</span>
    <span class="item"><span class="icon-field-test"></span> field trial</span>
    <span class="item"><span class="icon-academic"></span> academic</span>
    <span class="item"><span class="icon-personal"></span> personal</span>
  </div>
</div>
#+end_export

Clicking on a news item toggles further information.

** 2025

#+html: <details class="entry"><summary><span class="month">Feb</span><span class="icon-personal"></span><span class="head">I appeared on the Ignition Sequence podcast.</span></summary>
#+html: <div class="body">

I recently joined the [[https://www.youtube.com/watch?v=VsF546ydyRc][Ignition Sequence]] podcast to talk about my work in robotics and my row across the Atlantic. This was my first time on a podcast, and I'd love to get some feedback. So if you do give it a listen, please let me know what you think!
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Jan</span><span class="icon-position"></span><span class="head">I got promoted to Senior Robotics Engineer at Gravis.</span></summary>
#+html: <div class="body">

I got promoted to Senior Robotics Engineer at [[https://www.gravisrobotics.com][Gravis Robotics]]. I also stepped into the role of Deputy Team Lead of the autonomy team.
#+html: </div></details>

** 2024

#+html: <details class="entry"><summary><span class="month">Mar</span><span class="icon-position"></span><span class="head">I started as a Robotics Engineer at Gravis Robotics.</span></summary>
#+html: <div class="body">

I accepted a position as a Robotics Engineer at [[https://www.gravisrobotics.com][Gravis Robotics]], an early-stage startup that automates heavy machinery. I'm part of the autonomy team and primarily work on motion- and mission-planning. I have been following the research done by the team at Gravis for multiple years and am absolutely stoked to start contributing to its commercialization.
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Feb</span><span class="icon-publication"></span><span class="head">Tiago's EELS paper was accepted at Science Robotics.</span></summary>
#+html: <div class="body">

[[https://ai.jpl.nasa.gov/public/people/tvaquero/][Tiago]] wrote a paper detailing the [[https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/][Exobiology Extant Life Surveyor (EELS)]] system, with a focus on mission-planning under uncertainty.

#+html: <p>Visit my <a target="_self" href="./publications.html#vaquero_sr2024">publications page</a> for the complete author list and a bibtex entry.</p>
#+html: </div></details>

** 2023

#+html: <details class="entry"><summary><span class="month">Jul</span><span class="icon-publication"></span><span class="head">Our EELS paper was accepted at IROS.</span></summary>
#+html: <div class="body">

The [[https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/][Exobiology Extant Life Surveyor (EELS)]] team wrote a paper that presents control and planning algorithms for EELS. One of the core ideas of the paper is to decouple shape control from motion control for screw-based gaits. This lets us tackle the control and planning problems with relatively simple algorithms despite the many (>30) degrees of freedom EELS has. The paper was nominated for a best-paper award.

#+html: <p>Visit my <a target="_self" href="./publications.html#thakker_iros2023">publications page</a> for the complete author list and a bibtex entry.</p>
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Feb</span><span class="icon-code"></span><span class="head">Effort Informed Trees (EIT*) was merged into OMPL.</span></summary>
#+html: <div class="body">

A reference implementation of EIT* ([[https://arxiv.org/abs/2111.01877][arxiv]], [[https://www.doi.org/10.1177/02783649211069572][doi]]), the final algorithm of my PhD thesis, is now also publicly available in the [[https://ompl.kavrakilab.org/][Open Motion Planning Library (OMPL)]]. Implementing this has been more of a challenge than anticipated, both technically and in terms of making time for it.

#+html: <p>EIT* is not included in the official OMPL documentation yet, but you can find its header file <a href="https://github.com/ompl/ompl/blob/19e007c97e7d500270798b53f243592c4428cb10/src/ompl/geometric/planners/informedtrees/EITstar.h#L57">here</a>.</p>
#+html: </div></details>

