news.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Marlin P. Strub</title>
<meta name="description" content="Career timeline of Marlin P. Strub: positions, publications, field tests, and personal milestones." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"><base target="_blank"><meta property="og:image" content="https://www.marlinstrub.com/assets/profile_picture.jpg"><link rel="icon" type="image/svg+xml" href="/assets/favicon.svg"><link rel="icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/assets/apple-touch-icon.png">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Marlin P. Strub
<br />
<span class="subtitle">Roboticist and C++ enthusiast</span>
</h1>
<nav class="site-nav">
  <ul>
    <li><a target="_self" href="index.html">About</a></li>
    <li><a target="_self" href="news.html">News</a></li>
    <li><a target="_self" href="research.html">Research</a></li>
    <li><a target="_self" href="publications.html">Publications</a></li>
  </ul>
</nav>
<script>
  (function () {
    var name = location.pathname.split('/').pop().replace(/\.html$/, '') || 'index';
    document.body.classList.add('page-' + name);
  })();
</script>

<div id="outline-container-orgbf17cc7" class="outline-2">
<h2 id="orgbf17cc7">Logbook</h2>
<div class="outline-text-2" id="text-orgbf17cc7">
<div class="legend">
  <div class="label">Legend</div>
  <div class="items">
    <span class="item"><span class="icon-publication"></span> publication</span>
    <span class="item"><span class="icon-code"></span> open-source</span>
    <span class="item"><span class="icon-position"></span> new position</span>
    <span class="item"><span class="icon-field-test"></span> field trial</span>
    <span class="item"><span class="icon-academic"></span> academic</span>
    <span class="item"><span class="icon-personal"></span> personal</span>
  </div>
</div>

<p>
Clicking on a news item toggles further information.
</p>
</div>

<div id="outline-container-org2d99e61" class="outline-3">
<h3 id="org2d99e61">2025</h3>
<div class="outline-text-3" id="text-org2d99e61">
<details class="entry"><summary><span class="month">Feb</span><span class="icon-personal"></span><span class="head">I appeared on the Ignition Sequence podcast.</span></summary>
<div class="body">

<p>
I recently joined the <a href="https://www.youtube.com/watch?v=VsF546ydyRc">Ignition Sequence</a> podcast to talk about my work in robotics and my row across the Atlantic. This was my first time on a podcast, and I'd love to get some feedback. So if you do give it a listen, please let me know what you think!
</p>
</div></details>

<details class="entry"><summary><span class="month">Jan</span><span class="icon-position"></span><span class="head">I got promoted to Senior Robotics Engineer at Gravis.</span></summary>
<div class="body">

<p>
I got promoted to Senior Robotics Engineer at <a href="https://www.gravisrobotics.com">Gravis Robotics</a>. I also stepped into the role of Deputy Team Lead of the autonomy team.
</p>
</div></details>
</div>
</div>

<div id="outline-container-org7dd2605" class="outline-3">
<h3 id="org7dd2605">2024</h3>
<div class="outline-text-3" id="text-org7dd2605">
<details class="entry"><summary><span class="month">Mar</span><span class="icon-position"></span><span class="head">I started as a Robotics Engineer at Gravis Robotics.</span></summary>
<div class="body">

<p>
I accepted a position as a Robotics Engineer at <a href="https://www.gravisrobotics.com">Gravis Robotics</a>, an early-stage startup that automates heavy machinery. I'm part of the autonomy team and primarily work on motion- and mission-planning. I have been following the research done by the team at Gravis for multiple years and am absolutely stoked to start contributing to its commercialization.
</p>
</div></details>

<details class="entry"><summary><span class="month">Feb</span><span class="icon-publication"></span><span class="head">Tiago's EELS paper was accepted at Science Robotics.</span></summary>
<div class="body">

<p>
<a href="https://ai.jpl.nasa.gov/public/people/tvaquero/">Tiago</a> wrote a paper detailing the <a href="https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/">Exobiology Extant Life Surveyor (EELS)</a> system, with a focus on mission-planning under uncertainty.
</p>

<p>Visit my <a target="_self" href="./publications.html#vaquero_sr2024">publications page</a> for the complete author list and a bibtex entry.</p>
</div></details>
</div>
</div>

<div id="outline-container-org9e9bb35" class="outline-3">
<h3 id="org9e9bb35">2023</h3>
<div class="outline-text-3" id="text-org9e9bb35">
<details class="entry"><summary><span class="month">Jul</span><span class="icon-publication"></span><span class="head">Our EELS paper was accepted at IROS.</span></summary>
<div class="body">

<p>
The <a href="https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/">Exobiology Extant Life Surveyor (EELS)</a> team wrote a paper that presents control and planning algorithms for EELS. One of the core ideas of the paper is to decouple shape control from motion control for screw-based gaits. This lets us tackle the control and planning problems with relatively simple algorithms despite the many (&gt;30) degrees of freedom EELS has. The paper was nominated for a best-paper award.
</p>

<p>Visit my <a target="_self" href="./publications.html#thakker_iros2023">publications page</a> for the complete author list and a bibtex entry.</p>
</div></details>

<details class="entry"><summary><span class="month">Feb</span><span class="icon-code"></span><span class="head">Effort Informed Trees (EIT*) was merged into OMPL.</span></summary>
<div class="body">

<p>
A reference implementation of EIT* (<a href="https://arxiv.org/abs/2111.01877">arxiv</a>, <a href="https://www.doi.org/10.1177/02783649211069572">doi</a>), the final algorithm of my PhD thesis, is now also publicly available in the <a href="https://ompl.kavrakilab.org/">Open Motion Planning Library (OMPL)</a>. Implementing this has been more of a challenge than anticipated, both technically and in terms of making time for it.
</p>

<p>EIT* is not included in the official OMPL documentation yet, but you can find its header file <a href="https://github.com/ompl/ompl/blob/19e007c97e7d500270798b53f243592c4428cb10/src/ompl/geometric/planners/informedtrees/EITstar.h#L57">here</a>.</p>
</div></details>
</div>
</div>
