content/news.org
** 2022

#+html: <details class="entry"><summary><span class="month">Oct</span><span class="icon-position"></span><span class="head">I was promoted to Robotics Technologist at NASA/JPL.</span></summary>
#+html: <div class="body">

I was promoted to Robotics Technologist at JPL. Fortunately my responsibilities stay the same, so I still get to do hands-on robotics work on the [[https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/][Exobiology Extant Life Surveyor (EELS)]] and the [[https://mars.nasa.gov/msr/spacecraft/sample-recovery-helicopters/][Sample Recovery Helicopters (SRH)]] ground mobility effort.
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Sep</span><span class="icon-field-test"></span><span class="head">We went on a 2nd NASA/JPL field trial in Alberta, CA.</span></summary>
#+html: <div class="body">

I conducted another field trial with the [[https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/][Exobiology Extant Life Surveyor (EELS)]] team, again on the [[https://maps.app.goo.gl/1Atk21sDF6aaw97J9][Athabasca Glacier]]. This time we stayed on the ice for three weeks and tested two robots and multiple science instruments. It was even better than last time, as we were able to move more independently on the glacier having had more rope-training in advance.
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Aug</span><span class="icon-publication"></span><span class="head">Wil's TMIT* paper was published in RA-L.</span></summary>
#+html: <div class="body">

I coauthored a paper with [[https://wbthomason.com/][Wil]] and [[https://robotic-esp.com/gammell/][Jon]] that presents Task and Motion Informed Trees (TMIT*; [[https://arxiv.org/abs/2210.09367][arxiv]], [[https://www.doi.org/10.1109/LRA.2022.3199676][doi]]), an integrated task and motion planning algorithm. TMIT* combines AIT* with [[https://www.cs.cornell.edu/~wil/papers/isrr2019_unifiedtamp.pdf][PLANET]] to improve performance when high-level tasks, such as sorting potentially stacked objects, require reasoning about the order in which path-planning problems are to be executed.

#+html: <p>A bibtex entry for TMIT* is available on my <a target="_self" href="./publications.html#thomason_ral2022">publications page</a>.</p>
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Jul</span><span class="icon-publication"></span><span class="head">Valentin's EIRM* paper was published in ISRR.</span></summary>
#+html: <div class="body">

I coauthored a paper with [[https://vhartmann.com/][Valentin]] and [[https://robotic-esp.com/gammell/][Jon]] that presents Effort Informed Roadmaps ([[./publications.html#hartmann_isrr2022][EIRM*]]; [[https://arxiv.org/pdf/2205.08480][arxiv]]), an multi-query extension to EIT*. EIRM* deliberatively reuses search-effort when solving path-planning problems that are similar to problems it has solved before. This improves performance on successive problems compared to popular single-query and multi-query planners, including EIT*, RRT-Connect, and PRM*.

#+html: <p>A bibtex entry for EIRM* is available on my <a target="_self" href="./publications.html#hartmann_isrr2022">publications page</a>.</p>
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Jan</span><span class="icon-position"></span><span class="head">I started as a postdoc at NASA/JPL.</span></summary>
#+html: <div class="body">

I accepted a position as a postdoctoral researcher at NASA/JPL. I'm part of the autonomy team for a snake-like robot called [[https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/][EELS]] that is being built to explore alien worlds. My work focuses on coming up with path planning and control approaches for EELS and includes contributing to the corresponding modules in its C++ autonomy stack.
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Jan</span><span class="icon-academic"></span><span class="head">I passed my PhD defense at the University of Oxford.</span></summary>
#+html: <div class="body">

I successfully defended my PhD thesis at the University of Oxford ([[https://ora.ox.ac.uk/objects/uuid:1a241006-0ddd-4829-bdd5-ade7301c863a][Oxford Archive]]). There are a thousand people to thank. Here I just want to thank [[https://robotic-esp.com/gammell/][Jon]] for letting me stand on his shoulders these past few years and [[https://www.robots.ox.ac.uk/~nickh/][Nick]] and [[https://www.cs.unh.edu/~ruml/][Wheeler]] for the time, energy, and thoughts they invested to help me improve my work.

#+html: <p>A bibtex entry for my thesis is available on my <a target="_self" href="./publications.html#strub_phd2022">publications page</a>.</p>
#+html: </div></details>

** 2021

#+html: <details class="entry"><summary><span class="month">Nov</span><span class="icon-publication"></span><span class="head">The journal paper on AIT* & EIT* was accepted at IJRR.</span></summary>
#+html: <div class="body">

My first journal paper got accepted at IJRR ([[https://arxiv.org/abs/2111.01877][arxiv]], [[https://www.doi.org/10.1177/02783649211069572][doi]]). AIT* and EIT* improve planning performance by leveraging multiple sources of information with an asymmetric bidirectional search. A high-level explanation of what these terms mean is available [[https://youtu.be/aC2xBwOcDoo][on youtube]].

#+html: <p>A bibtex entry for this journal paper is available on my <a target="_self" href="./publications.html#strub_ijrr2021">publications page</a>.</p>
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Sep</span><span class="icon-field-test"></span><span class="head">We went on a NASA/JPL field trial in Alberta, CA.</span></summary>
#+html: <div class="body">

I conducted a 10-day field trial as part of the [[https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/][Exobiology Extant Life Surveyor (EELS)]] team at JPL. We tested our sensors and SLAM algorithms on the [[https://maps.app.goo.gl/1Atk21sDF6aaw97J9][Athabasca Glacier]] in the Canadian Rockies. It was my first time on a glacier - what an incredible experience. Our safety team, [[https://www.directactionvertical.com/][Direct Action Vertical (DAV)]], even let us rappel down moulins and crevasses!
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Apr</span><span class="icon-publication"></span><span class="head">My report on obstacle-clearance heuristics is on arXiv.</span></summary>
#+html: <div class="body">

Obstacle clearance in search space is an important optimization objective in path planning because it can result in safe paths. This technical report presents admissible heuristics that can improve planning performance when optimizing this objective ([[https://arxiv.org/abs/2104.02298][arxiv]]).

#+html: <p>A bibtex entry for this report is available on my <a target="_self" href="./publications.html#strub_tr2021">publications page</a>.</p>
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Mar</span><span class="icon-code"></span><span class="head">The OMPL team made me a co-maintainer.</span></summary>
#+html: <div class="body">

The [[https://ompl.kavrakilab.org/][Open Motion Planning Library (OMPL)]] has been immensely useful in my own research and I'm stoked to join its impressive team of maintainers. Very much looking forward to contributing more to OMPL.
#+html: </div></details>

