news.html

<div id="outline-container-org654195a" class="outline-3">
<h3 id="org654195a">2022</h3>
<div class="outline-text-3" id="text-org654195a">
<details class="entry"><summary><span class="month">Oct</span><span class="icon-position"></span><span class="head">I was promoted to Robotics Technologist at NASA/JPL.</span></summary>
<div class="body">

<p>
I was promoted to Robotics Technologist at JPL. Fortunately my responsibilities stay the same, so I still get to do hands-on robotics work on the <a href="https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/">Exobiology Extant Life Surveyor (EELS)</a> and the <a href="https://mars.nasa.gov/msr/spacecraft/sample-recovery-helicopters/">Sample Recovery Helicopters (SRH)</a> ground mobility effort.
</p>
</div></details>

<details class="entry"><summary><span class="month">Sep</span><span class="icon-field-test"></span><span class="head">We went on a 2nd NASA/JPL field trial in Alberta, CA.</span></summary>
<div class="body">

<p>
I conducted another field trial with the <a href="https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/">Exobiology Extant Life Surveyor (EELS)</a> team, again on the <a href="https://maps.app.goo.gl/1Atk21sDF6aaw97J9">Athabasca Glacier</a>. This time we stayed on the ice for three weeks and tested two robots and multiple science instruments. It was even better than last time, as we were able to move more independently on the glacier having had more rope-training in advance.
</p>
</div></details>

<details class="entry"><summary><span class="month">Aug</span><span class="icon-publication"></span><span class="head">Wil's TMIT* paper was published in RA-L.</span></summary>
<div class="body">

<p>
I coauthored a paper with <a href="https://wbthomason.com/">Wil</a> and <a href="https://robotic-esp.com/gammell/">Jon</a> that presents Task and Motion Informed Trees (TMIT*; <a href="https://arxiv.org/abs/2210.09367">arxiv</a>, <a href="https://www.doi.org/10.1109/LRA.2022.3199676">doi</a>), an integrated task and motion planning algorithm. TMIT* combines AIT* with <a href="https://www.cs.cornell.edu/~wil/papers/isrr2019_unifiedtamp.pdf">PLANET</a> to improve performance when high-level tasks, such as sorting potentially stacked objects, require reasoning about the order in which path-planning problems are to be executed.
</p>

<p>A bibtex entry for TMIT* is available on my <a target="_self" href="./publications.html#thomason_ral2022">publications page</a>.</p>
</div></details>

<details class="entry"><summary><span class="month">Jul</span><span class="icon-publication"></span><span class="head">Valentin's EIRM* paper was published in ISRR.</span></summary>
<div class="body">

<p>
I coauthored a paper with <a href="https://vhartmann.com/">Valentin</a> and <a href="https://robotic-esp.com/gammell/">Jon</a> that presents Effort Informed Roadmaps (<a href="./publications.html#hartmann_isrr2022">EIRM*</a>; <a href="https://arxiv.org/pdf/2205.08480">arxiv</a>), an multi-query extension to EIT*. EIRM* deliberatively reuses search-effort when solving path-planning problems that are similar to problems it has solved before. This improves performance on successive problems compared to popular single-query and multi-query planners, including EIT*, RRT-Connect, and PRM*.
</p>

<p>A bibtex entry for EIRM* is available on my <a target="_self" href="./publications.html#hartmann_isrr2022">publications page</a>.</p>
</div></details>

<details class="entry"><summary><span class="month">Jan</span><span class="icon-position"></span><span class="head">I started as a postdoc at NASA/JPL.</span></summary>
<div class="body">

<p>
I accepted a position as a postdoctoral researcher at NASA/JPL. I'm part of the autonomy team for a snake-like robot called <a href="https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/">EELS</a> that is being built to explore alien worlds. My work focuses on coming up with path planning and control approaches for EELS and includes contributing to the corresponding modules in its C++ autonomy stack.
</p>
</div></details>

<details class="entry"><summary><span class="month">Jan</span><span class="icon-academic"></span><span class="head">I passed my PhD defense at the University of Oxford.</span></summary>
<div class="body">

<p>
I successfully defended my PhD thesis at the University of Oxford (<a href="https://ora.ox.ac.uk/objects/uuid:1a241006-0ddd-4829-bdd5-ade7301c863a">Oxford Archive</a>). There are a thousand people to thank. Here I just want to thank <a href="https://robotic-esp.com/gammell/">Jon</a> for letting me stand on his shoulders these past few years and <a href="https://www.robots.ox.ac.uk/~nickh/">Nick</a> and <a href="https://www.cs.unh.edu/~ruml/">Wheeler</a> for the time, energy, and thoughts they invested to help me improve my work.
</p>

<p>A bibtex entry for my thesis is available on my <a target="_self" href="./publications.html#strub_phd2022">publications page</a>.</p>
</div></details>
</div>
</div>

<div id="outline-container-org10ebe36" class="outline-3">
<h3 id="org10ebe36">2021</h3>
<div class="outline-text-3" id="text-org10ebe36">
<details class="entry"><summary><span class="month">Nov</span><span class="icon-publication"></span><span class="head">The journal paper on AIT* & EIT* was accepted at IJRR.</span></summary>
<div class="body">

<p>
My first journal paper got accepted at IJRR (<a href="https://arxiv.org/abs/2111.01877">arxiv</a>, <a href="https://www.doi.org/10.1177/02783649211069572">doi</a>). AIT* and EIT* improve planning performance by leveraging multiple sources of information with an asymmetric bidirectional search. A high-level explanation of what these terms mean is available <a href="https://youtu.be/aC2xBwOcDoo">on youtube</a>.
</p>

<p>A bibtex entry for this journal paper is available on my <a target="_self" href="./publications.html#strub_ijrr2021">publications page</a>.</p>
</div></details>

<details class="entry"><summary><span class="month">Sep</span><span class="icon-field-test"></span><span class="head">We went on a NASA/JPL field trial in Alberta, CA.</span></summary>
<div class="body">

<p>
I conducted a 10-day field trial as part of the <a href="https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/exobiology-extant-life-surveyor-eels/">Exobiology Extant Life Surveyor (EELS)</a> team at JPL. We tested our sensors and SLAM algorithms on the <a href="https://maps.app.goo.gl/1Atk21sDF6aaw97J9">Athabasca Glacier</a> in the Canadian Rockies. It was my first time on a glacier - what an incredible experience. Our safety team, <a href="https://www.directactionvertical.com/">Direct Action Vertical (DAV)</a>, even let us rappel down moulins and crevasses!
</p>
</div></details>

<details class="entry"><summary><span class="month">Apr</span><span class="icon-publication"></span><span class="head">My report on obstacle-clearance heuristics is on arXiv.</span></summary>
<div class="body">

<p>
Obstacle clearance in search space is an important optimization objective in path planning because it can result in safe paths. This technical report presents admissible heuristics that can improve planning performance when optimizing this objective (<a href="https://arxiv.org/abs/2104.02298">arxiv</a>).
</p>

<p>A bibtex entry for this report is available on my <a target="_self" href="./publications.html#strub_tr2021">publications page</a>.</p>
</div></details>

<details class="entry"><summary><span class="month">Mar</span><span class="icon-code"></span><span class="head">The OMPL team made me a co-maintainer.</span></summary>
<div class="body">

<p>
The <a href="https://ompl.kavrakilab.org/">Open Motion Planning Library (OMPL)</a> has been immensely useful in my own research and I'm stoked to join its impressive team of maintainers. Very much looking forward to contributing more to OMPL.
</p>
</div></details>
</div>
</div>
