news.html

<div id="outline-container-org5986034" class="outline-3">
<h3 id="org5986034">2020</h3>
<div class="outline-text-3" id="text-org5986034">
<details class="entry"><summary><span class="month">Sep</span><span class="icon-code"></span><span class="head">My first (tiny) contribution got merged into Emacs.</span></summary>
<div class="body">

<p>
I use <a href="https://www.gnu.org/software/emacs/">Emacs</a> for many things (too many, perhaps). Emacs has <a href="https://orgmode.org/">org-mode</a>, which is, among other things, an excellent tool for note-taking and journaling. I fixed <a href="https://github.com/TonCherAmi/org-starless/issues/1">this tiny bug</a> in org-mode that was exposed by a package that (subjectively) improves the appearance of org-mode by hiding some markup symbols.
</p>
</div></details>

<details class="entry"><summary><span class="month">Sep</span><span class="icon-publication"></span><span class="head">Jon's survey paper was accepted at ARCRAS.</span></summary>
<div class="body">

<p>
I assisted <a href="https://robotic-esp.com/gammell/">Jon</a> in surveying the field of asymptotically optimal sampling-based path planning algorithms for an invited paper in the <i>Annual Review of Controls, Robotics, and Autonomous Systems</i> (<a href="https://arxiv.org/abs/2009.10484">arxiv</a>, <a href="https://www.annualreviews.org/doi/full/10.1146/annurev-control-061920-093753">annualreviews</a>). The survey cites 150 publications and includes thorough problem definition and assumption sections.
</p>

<p>A bibtex entry for Jon's survey is available on my <a target="_self" href="./publications.html#gammell_arcras2021">publications page</a>.</p>
</div></details>

<details class="entry"><summary><span class="month">Aug</span><span class="icon-publication"></span><span class="head">Mike's paper was accepted at IROS.</span></summary>
<div class="body">

<p>
I helped <a href="https://www-robotics.jpl.nasa.gov/who-we-are/people/michael_paton/">Mike</a> with a paper that presents the autonomy system used on <a href="https://www-robotics.jpl.nasa.gov/how-we-do-it/systems/the-axel-rover/">Axel</a> during the field trial last summer. The autonomy system includes a stability analysis that predicts the interaction of Axel's tether with the terrain. My main contribution was to describe how we adapted ABIT* to work with Axel's tether-induced non-Markovian states. You can find an open-access version of it on the <a href="https://robotic-esp.com/papers/paton_iros20.html">ESP website</a>.
</p>

<p>The paper was nominated for a best-paper award. A bibtex entry for it is available on my <a target="_self" href="./publications.html#paton_iros2020">publications page</a>.</p>
</div></details>

<details class="entry"><summary><span class="month">May</span><span class="icon-code"></span><span class="head">ABIT* and AIT* were merged into OMPL.</span></summary>
<div class="body">

<p>
ABIT* and AIT* were merged into the <a href="https://ompl.kavrakilab.org/">Open Motion Planning Library (OMPL)</a>. This is my first major contribution to an open-source library. I'm hoping ABIT* and AIT* will be useful for someone.
</p>

<p>The documentation for ABIT* and AIT* is available <a href="https://ompl.kavrakilab.org/classompl_1_1geometric_1_1ABITstar.html#gABITstar">here</a> and <a href="https://ompl.kavrakilab.org/classompl_1_1geometric_1_1AITstar.html#gAITstar">here</a>, repectively.</p>
</div></details>

<details class="entry"><summary><span class="month">Feb</span><span class="icon-code"></span><span class="head">OpenRAVE accepted my first feature contribution.</span></summary>
<div class="body">

<p>
I implemented a feature that allows using the <a href="https://github.com/flexible-collision-library/fcl">Flexible Collision Library (FCL)</a> for distance queries in <a href="https://github.com/rdiankov/openrave">OpenRAVE</a>. This constitutes my first minor contribution to an open-source library and I'm very happy to finally being able to contribute back to the community.
</p>
</div></details>

<details class="entry"><summary><span class="month">Feb</span><span class="icon-publication"></span><span class="head">Adaptively Informed Trees (AIT*) was accepted at ICRA.</span></summary>
<div class="body">

<p>
My second paper got accepted at ICRA (<a href="https://arxiv.org/abs/2002.06599">arxiv</a>, <a href="https://doi.org/10.1109/ICRA40945.2020.9197338">doi</a>). AIT* improves planning performance with an asymmetric bidirectional search in which both searches continuously inform each other with complementary information. A high-level presentation of these concepts is on <a href="https://www.youtube.com/watch?v=1h7ugF9F6VM">youtube</a>.
</p>

<p>A bibtex entry for my AIT* paper is available on my <a target="_self" href="./publications.html#strub_icra2020b">publications page</a>.</p>
</div></details>

<details class="entry"><summary><span class="month">Feb</span><span class="icon-publication"></span><span class="head">Advanced BIT* (ABIT*) was accepted at ICRA.</span></summary>
<div class="body">

<p>
My first paper got accepted at ICRA (<a href="https://arxiv.org/abs/2002.06589">arxiv</a>, <a href="https://doi.org/10.1109/ICRA40945.2020.9196580">doi</a>). ABIT* leverages advanced graph-search techniques, such as inflation and truncation, in sampling-based path planning. This is the algorithm we tested last summer. A high-level presentation of these concepts is on <a href="https://www.youtube.com/watch?v=ZghEeVGgecY">youtube</a>.
</p>

<p>A bibtex entry for my ABIT* paper is available on my <a target="_self" href="./publications.html#strub_icra2020a">publications page</a>.</p>
</div></details>
</div>
</div>

<div id="outline-container-org298f4be" class="outline-3">
<h3 id="org298f4be">2019</h3>
<div class="outline-text-3" id="text-org298f4be">
<details class="entry"><summary><span class="month">Jul</span><span class="icon-field-test"></span><span class="head">Jon & I joined a NASA/JPL field test in California.</span></summary>
<div class="body">

<p>
<a href="https://robotic-esp.com/gammell/">Jon</a> and I had the chance to join the <a href="https://www.jpl.nasa.gov/">NASA Jet Propulsion Laboratory (JPL)</a> on a <a href="https://www.youtube.com/watch?v=GUNWVroyys4">field trial for Axel</a> in the Mojave Desert. We tested new path planning techniques and supported the JPL team in running science and autonomy experiments.
</p>
</div></details>
</div>
</div>
