content/news.org
** 2018

#+html: <details class="entry"><summary><span class="month">Sep</span><span class="icon-academic"></span><span class="head">I started my PhD at the University of Oxford.</span></summary>
#+html: <div class="body">

I joined [[https://robotic-esp.com/gammell/][Jon]]'s [[https://robotic-esp.com/][Estimation, Search, and Planning Group]] at the [[https://ori.ox.ac.uk/][Oxford Robotics Institute]] to work on path planning for complex systems.
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Jun</span><span class="icon-personal"></span><span class="head">The documentary about our row is on national TV.</span></summary>
#+html: <div class="body">

The Swiss national television produced a 4-part documentary about our row across the Atlantic. If your IP is from Switzerland, you can watch it [[https://www.srf.ch/play/tv/sendung/rudern-am-limit?id=c82c1f74-2f6f-4e78-af79-b362f008fc91][here]]. It's in Swiss German, but there's also a version of it with English subtitles on [[https://www.youtube.com/playlist?list=PLoxsQMM4ggWFoDgPxYeukqFxZ8K3CPG2n][youtube]]. Edit: There's now also a 90-minute version of it as well.
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Feb</span><span class="icon-personal"></span><span class="head">ETH published my blog about rowing the Atlantic.</span></summary>
#+html: <div class="body">

[[https://ethz.ch/][ETH Zürich]] asked me to write a blog post about rowing the Atlantic, which I happily did. You can read it [[https://ethambassadors.ethz.ch/2018/02/15/rowing-the-atlantic/][here]].
#+html: </div></details>

#+html: <details class="entry"><summary><span class="month">Jan</span><span class="icon-personal"></span><span class="head">We completed our unassisted row across the Atlantic!</span></summary>
#+html: <div class="body">

[[https://premium-speakers.com/en/speaker-presenter/swiss-mocean-team/][Swiss Mocean]] took third place in the 2017 edition of the [[https://www.worldstoughestrow.com/][Worlds Toughest Row]] and became the first Swiss fours to row any ocean. It took us 30 days, 4 hours, and 59 minutes to row from the Canaries to the Caribbean Islands.
#+html: </div></details>

** 2017

#+html: <details class="entry"><summary><span class="month">Nov</span><span class="icon-academic"></span><span class="head">I passed my MSc defense at ETH Zürich.</span></summary>
#+html: <div class="body">

I successfully defended my Master's thesis at ETH Zurich. I'm immensely grateful to [[https://v4rl.com/blog/dr-chli-margarita/the-lab][Margarita]], [[https://scholar.google.ch/citations?user=rom2e8oAAAAJ&hl=en][Fabiola]], and [[https://sites.google.com/view/lucas-teixeira/][Lucas]] for their guidance throughout my time at the [[https://v4rl.com/][Vision for Robotics Lab]].
#+html: </div></details>
