news.html

<div id="outline-container-orgd5f0fc9" class="outline-3">
<h3 id="orgd5f0fc9">2018</h3>
<div class="outline-text-3" id="text-orgd5f0fc9">
<details class="entry"><summary><span class="month">Sep</span><span class="icon-academic"></span><span class="head">I started my PhD at the University of Oxford.</span></summary>
<div class="body">

<p>
I joined <a href="https://robotic-esp.com/gammell/">Jon</a>'s <a href="https://robotic-esp.com/">Estimation, Search, and Planning Group</a> at the <a href="https://ori.ox.ac.uk/">Oxford Robotics Institute</a> to work on path planning for complex systems.
</p>
</div></details>

<details class="entry"><summary><span class="month">Jun</span><span class="icon-personal"></span><span class="head">The documentary about our row is on national TV.</span></summary>
<div class="body">

<p>
The Swiss national television produced a 4-part documentary about our row across the Atlantic. If your IP is from Switzerland, you can watch it <a href="https://www.srf.ch/play/tv/sendung/rudern-am-limit?id=c82c1f74-2f6f-4e78-af79-b362f008fc91">here</a>. It's in Swiss German, but there's also a version of it with English subtitles on <a href="https://www.youtube.com/playlist?list=PLoxsQMM4ggWFoDgPxYeukqFxZ8K3CPG2n">youtube</a>. Edit: There's now also a 90-minute version of it as well.
</p>
</div></details>

<details class="entry"><summary><span class="month">Feb</span><span class="icon-personal"></span><span class="head">ETH published my blog about rowing the Atlantic.</span></summary>
<div class="body">

<p>
<a href="https://ethz.ch/">ETH Zürich</a> asked me to write a blog post about rowing the Atlantic, which I happily did. You can read it <a href="https://ethambassadors.ethz.ch/2018/02/15/rowing-the-atlantic/">here</a>.
</p>
</div></details>

<details class="entry"><summary><span class="month">Jan</span><span class="icon-personal"></span><span class="head">We completed our unassisted row across the Atlantic!</span></summary>
<div class="body">

<p>
<a href="https://premium-speakers.com/en/speaker-presenter/swiss-mocean-team/">Swiss Mocean</a> took third place in the 2017 edition of the <a href="https://www.worldstoughestrow.com/">Worlds Toughest Row</a> and became the first Swiss fours to row any ocean. It took us 30 days, 4 hours, and 59 minutes to row from the Canaries to the Caribbean Islands.
</p>
</div></details>
</div>
</div>

<div id="outline-container-orge37f622" class="outline-3">
<h3 id="orge37f622">2017</h3>
<div class="outline-text-3" id="text-orge37f622">
<details class="entry"><summary><span class="month">Nov</span><span class="icon-academic"></span><span class="head">I passed my MSc defense at ETH Zürich.</span></summary>
<div class="body">

<p>
I successfully defended my Master's thesis at ETH Zurich. I'm immensely grateful to <a href="https://v4rl.com/blog/dr-chli-margarita/the-lab">Margarita</a>, <a href="https://scholar.google.ch/citations?user=rom2e8oAAAAJ&amp;hl=en">Fabiola</a>, and <a href="https://sites.google.com/view/lucas-teixeira/">Lucas</a> for their guidance throughout my time at the <a href="https://v4rl.com/">Vision for Robotics Lab</a>.
</p>
</div></details>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<nav class="site-footer">
<a href="mailto:marlin.strub@gmail.com"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M3 7a2 2 0 0 1 2 -2h14a2 2 0 0 1 2 2v10a2 2 0 0 1 -2 2h-14a2 2 0 0 1 -2 -2v-10z"/><path d="M3 7l9 6l9 -6"/></svg>Email</a>
<span class="separator">·</span>
<a href="https://github.com/marlinstrub"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M9 19c-4.3 1.4 -4.3 -2.5 -6 -3m12 5v-3.5c0 -1 .1 -1.4 -.5 -2c2.8 -.3 5.5 -1.4 5.5 -6a4.6 4.6 0 0 0 -1.3 -3.2a4.2 4.2 0 0 0 -.1 -3.2s-1.1 -.3 -3.5 1.3a12.3 12.3 0 0 0 -6.2 0c-2.4 -1.6 -3.5 -1.3 -3.5 -1.3a4.2 4.2 0 0 0 -.1 3.2a4.6 4.6 0 0 0 -1.3 3.2c0 4.6 2.7 5.7 5.5 6c-.6 .6 -.6 1.2 -.5 2v3.5"/></svg>GitHub</a>
<span class="separator">·</span>
<a href="https://linkedin.com/in/marlinstrub"><svg viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" aria-hidden="true"><path d="M4 4m0 2a2 2 0 0 1 2 -2h12a2 2 0 0 1 2 2v12a2 2 0 0 1 -2 2h-12a2 2 0 0 1 -2 -2z"/><path d="M8 11l0 5"/><path d="M8 8l0 .01"/><path d="M12 16l0 -5"/><path d="M16 16v-3a2 2 0 0 0 -4 0"/></svg>LinkedIn</a>
</nav>
</div>
</body>
</html>
